espressif/arduino-esp32/libraries/HTTPClient/src/HTTPClient.cpp
#include <HardwareSerial.h>
/**
 * HTTPClient.cpp
 *
 * Created on: 02.11.2015
 *
 * Copyright (c) 2015 Markus Sattler. All rights reserved.
 * This file is part of the HTTPClient for Arduino.
 * Port to ESP32 by Evandro Luis Copercini (2017),
 * changed fingerprints to CA verification.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 2.1 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
 *
 * Adapted in October 2018
 */

#include <Arduino.h>
#include <esp32-hal-log.h>
#include <StreamString.h>
#include <base64.h>
#include "HTTPClient.h"

/// Cookie jar support
#include <time.h>

#ifdef HTTPCLIENT_1_1_COMPATIBLE
class TransportTraits {
public:
  virtual ~TransportTraits() {}

  virtual std::unique_ptr<NetworkClient> create() {
    return std::unique_ptr<NetworkClient>(new NetworkClient());
  }

  virtual bool verify(NetworkClient &client, const char *host) {
    return true;
  }
};

#ifndef HTTPCLIENT_NOSECURE
class TLSTraits : public TransportTraits {
public:
  TLSTraits(const char *CAcert, const char *clicert = nullptr, const char *clikey = nullptr) : _cacert(CAcert), _clicert(clicert), _clikey(clikey) {}

  std::unique_ptr<NetworkClient> create() override {
    return std::unique_ptr<NetworkClient>(new NetworkClientSecure());
  }

  bool verify(NetworkClient &client, const char *host) override {
    NetworkClientSecure &wcs = static_cast<NetworkClientSecure &>(client);
    if (_cacert == nullptr) {
      wcs.setInsecure();
    } else {
      wcs.setCACert(_cacert);
      wcs.setCertificate(_clicert);
      wcs.setPrivateKey(_clikey);
    }
    return true;
  }

protected:
  const char *_cacert;
  const char *_clicert;
  const char *_clikey;
};
#endif  // HTTPCLIENT_NOSECURE
#endif  // HTTPCLIENT_1_1_COMPATIBLE

/**
 * constructor
 */
HTTPClient::HTTPClient() {}

/**
 * destructor
 */
HTTPClient::~HTTPClient() {
  if (_client) {
    _client->stop();
  }
  if (_currentHeaders) {
    delete[] _currentHeaders;
  }
  if (_tcpDeprecated) {
    _tcpDeprecated.reset(nullptr);
  }
  if (_transportTraits) {
    _transportTraits.reset(nullptr);
  }
}

void HTTPClient::clear() {
  _returnCode = 0;
  _size = -1;
  _headers = "";
}

/**
 * parsing the url for all needed parameters
 * @param client Client&
 * @param url String
 * @param https bool
 * @return success bool
 */
bool HTTPClient::begin(NetworkClient &client, String url) {
#ifdef HTTPCLIENT_1_1_COMPATIBLE
  if (_tcpDeprecated) {
    log_d("mix up of new and deprecated api");
    _canReuse = false;
    end();
  }
#endif

  _client = &client;

  // check for : (http: or https:)
  int index = url.indexOf(':');
  if (index < 0) {
    log_d("failed to parse protocol");
    return false;
  }

  String protocol = url.substring(0, index);
  if (protocol != "http" && protocol != "https") {
    log_d("unknown protocol '%s'", protocol.c_str());
    return false;
  }

  _port = (protocol == "https" ? 443 : 80);
  _secure = (protocol == "https");

#ifdef HTTPCLIENT_NOSECURE
  if (_secure) {
    return false;
  }
#endif  // HTTPCLIENT_NOSECURE
  return beginInternal(url, protocol.c_str());
}

/**
 * directly supply all needed parameters
 * @param client Client&
 * @param host String
 * @param port uint16_t
 * @param uri String
 * @param https bool
 * @return success bool
 */
bool HTTPClient::begin(NetworkClient &client, String host, uint16_t port, String uri, bool https) {
#ifdef HTTPCLIENT_1_1_COMPATIBLE
  if (_tcpDeprecated) {
    log_d("mix up of new and deprecated api");
    _canReuse = false;
    end();
  }
#endif

  _client = &client;

  clear();
  _host = host;
  _port = port;
  _uri = uri;
  _protocol = (https ? "https" : "http");
  _secure = https;

#ifdef HTTPCLIENT_NOSECURE
  return _secure ? false : true;
#else
  return true;
#endif  // HTTPCLIENT_NOSECURE
}

#ifdef HTTPCLIENT_1_1_COMPATIBLE
#ifndef HTTPCLIENT_NOSECURE
bool HTTPClient::begin(String url, const char *CAcert) {
  if (_client && !_tcpDeprecated) {
    log_d("mix up of new and deprecated api");
    _canReuse = false;
    end();
  }

  clear();
  _port = 443;
  if (!beginInternal(url, "https")) {
    return false;
  }
  _secure = true;
  _transportTraits = TransportTraitsPtr(new TLSTraits(CAcert));
  if (!_transportTraits) {
    log_e("could not create transport traits");
    return false;
  }

  return true;
}
#endif  // HTTPCLIENT_NOSECURE

/**
 * parsing the url for all needed parameters
 * @param url String
 */
bool HTTPClient::begin(String url) {
  if (_client && !_tcpDeprecated) {
    log_d("mix up of new and deprecated api");
    _canReuse = false;
    end();
  }

  clear();
  _port = 80;
  if (!beginInternal(url, "http")) {
#ifdef HTTPCLIENT_NOSECURE
    return false;
#else
    return begin(url, (const char *)NULL);
#endif  // HTTPCLIENT_NOSECURE
  }
  _transportTraits = TransportTraitsPtr(new TransportTraits());
  if (!_transportTraits) {
    log_e("could not create transport traits");
    return false;
  }

  return true;
}
#endif  // HTTPCLIENT_1_1_COMPATIBLE

bool HTTPClient::beginInternal(String url, const char *expectedProtocol) {
  log_v("url: %s", url.c_str());

  // check for : (http: or https:
  int index = url.indexOf(':');
  if (index < 0) {
    log_e("failed to parse protocol");
    return false;
  }

  _protocol = url.substring(0, index);
  if (_protocol != expectedProtocol) {
    log_d("unexpected protocol: %s, expected %s", _protocol.c_str(), expectedProtocol);
    return false;
  }

  url.remove(0, (index + 3));  // remove http:// or https://

  index = url.indexOf('/');
  if (index == -1) {
    index = url.length();
    url += '/';
  }
  String host = url.substring(0, index);
  url.remove(0, index);  // remove host part

  // get Authorization
  index = host.indexOf('@');
  if (index >= 0) {
    // auth info
    String auth = host.substring(0, index);
    host.remove(0, index + 1);  // remove auth part including @
    _base64Authorization = base64::encode(auth);
  }

