espressif/arduino-esp32/libraries/HTTPClient/src/HTTPClient.cpp
  // get port
  index = host.indexOf(':');
  String the_host;
  if (index >= 0) {
    the_host = host.substring(0, index);  // hostname
    host.remove(0, (index + 1));          // remove hostname + :
    _port = host.toInt();                 // get port
  } else {
    the_host = host;
  }
  if (_host != the_host && connected()) {
    log_d("switching host from '%s' to '%s'. disconnecting first", _host.c_str(), the_host.c_str());
    _canReuse = false;
    disconnect(true);
  }
  _host = the_host;
  _uri = url;
  log_d("protocol: %s, host: %s port: %d url: %s", _protocol.c_str(), _host.c_str(), _port, _uri.c_str());
  return true;
}

#ifdef HTTPCLIENT_1_1_COMPATIBLE
bool HTTPClient::begin(String host, uint16_t port, String uri) {
  if (_client && !_tcpDeprecated) {
    log_d("mix up of new and deprecated api");
    _canReuse = false;
    end();
  }

  clear();
  _host = host;
  _port = port;
  _uri = uri;
  _transportTraits = TransportTraitsPtr(new TransportTraits());
  log_d("host: %s port: %d uri: %s", host.c_str(), port, uri.c_str());
  return true;
}

#ifndef HTTPCLIENT_NOSECURE
bool HTTPClient::begin(String host, uint16_t port, String uri, const char *CAcert) {
  if (_client && !_tcpDeprecated) {
    log_d("mix up of new and deprecated api");
    _canReuse = false;
    end();
  }

  clear();
  _host = host;
  _port = port;
  _uri = uri;

  if (strlen(CAcert) == 0) {
    return false;
  }
  _secure = true;
  _transportTraits = TransportTraitsPtr(new TLSTraits(CAcert));
  return true;
}

bool HTTPClient::begin(String host, uint16_t port, String uri, const char *CAcert, const char *cli_cert, const char *cli_key) {
  if (_client && !_tcpDeprecated) {
    log_d("mix up of new and deprecated api");
    _canReuse = false;
    end();
  }

  clear();
  _host = host;
  _port = port;
  _uri = uri;

  if (strlen(CAcert) == 0) {
    return false;
  }
  _secure = true;
  _transportTraits = TransportTraitsPtr(new TLSTraits(CAcert, cli_cert, cli_key));
  return true;
}
#endif  // HTTPCLIENT_NOSECURE
#endif  // HTTPCLIENT_1_1_COMPATIBLE

/**
 * end
 * called after the payload is handled
 */
void HTTPClient::end(void) {
  disconnect(false);
  clear();
}

/**
 * disconnect
 * close the TCP socket
 */
void HTTPClient::disconnect(bool preserveClient) {
  if (connected()) {
    if (_client->available() > 0) {
      log_d("still data in buffer (%d), clean up.\n", _client->available());
      _client->clear();
    }

    if (_reuse && _canReuse) {
      log_d("tcp keep open for reuse");
    } else {
      log_d("tcp stop");
      _client->stop();
      if (!preserveClient) {
        _client = nullptr;
#ifdef HTTPCLIENT_1_1_COMPATIBLE
        if (_tcpDeprecated) {
          _transportTraits.reset(nullptr);
          _tcpDeprecated.reset(nullptr);
        }
#endif
      }
    }
  } else {
    log_d("tcp is closed\n");
  }
}

/**
 * connected
 * @return connected status
 */
bool HTTPClient::connected() {
  if (_client) {
    return ((_client->available() > 0) || _client->connected());
  }
  return false;
}

/**
 * try to reuse the connection to the server
 * keep-alive
 * @param reuse bool
 */
void HTTPClient::setReuse(bool reuse) {
  _reuse = reuse;
}

/**
 * set User Agent
 * @param userAgent const char *
 */
void HTTPClient::setUserAgent(const String &userAgent) {
  _userAgent = userAgent;
}

/**
 * set Accept Encoding Header
 * @param acceptEncoding const char *
 */
void HTTPClient::setAcceptEncoding(const String &acceptEncoding) {
  _acceptEncoding = acceptEncoding;
}

/**
 * set the Authorizatio for the http request
 * @param user const char *
 * @param password const char *
 */
void HTTPClient::setAuthorization(const char *user, const char *password) {
  if (user && password) {
    String auth = user;
    auth += ":";
    auth += password;
    _base64Authorization = base64::encode(auth);
  }
}

/**
 * set the Authorizatio for the http request
 * @param auth const char * base64
 */
void HTTPClient::setAuthorization(const char *auth) {
  if (auth) {
    _base64Authorization = auth;
  }
}

/**
 * set the Authorization type for the http request
 * @param authType const char *
 */
void HTTPClient::setAuthorizationType(const char *authType) {
  if (authType) {
    _authorizationType = authType;
  }
}

/**
 * set the timeout (ms) for establishing a connection to the server
 * @param connectTimeout int32_t
 */
void HTTPClient::setConnectTimeout(int32_t connectTimeout) {
  _connectTimeout = connectTimeout;
}

/**
 * set the timeout for the TCP connection
 * @param timeout unsigned int
 */
void HTTPClient::setTimeout(uint16_t timeout) {
  _tcpTimeout = timeout;
  if (connected()) {
    _client->setTimeout(timeout);
  }
}

/**
 * use HTTP1.0
 * @param use
 */
void HTTPClient::useHTTP10(bool useHTTP10) {
  _useHTTP10 = useHTTP10;
  _reuse = !useHTTP10;
}

/**
 * send a GET request
 * @return http code
 */
int HTTPClient::GET() {
  return sendRequest("GET");
}

/**
 * sends a post request to the server
 * @param payload uint8_t *
 * @param size size_t
 * @return http code
 */
int HTTPClient::POST(uint8_t *payload, size_t size) {
  return sendRequest("POST", payload, size);
}

int HTTPClient::POST(String payload) {
  return POST((uint8_t *)payload.c_str(), payload.length());
}

/**
 * sends a patch request to the server
 * @param payload uint8_t *
 * @param size size_t
 * @return http code
 */
int HTTPClient::PATCH(uint8_t *payload, size_t size) {
  return sendRequest("PATCH", payload, size);
}

int HTTPClient::PATCH(String payload) {
  return PATCH((uint8_t *)payload.c_str(), payload.length());
}

/**
 * sends a put request to the server
 * @param payload uint8_t *
 * @param size size_t
 * @return http code
 */
int HTTPClient::PUT(uint8_t *payload, size_t size) {
  return sendRequest("PUT", payload, size);
}

int HTTPClient::PUT(String payload) {
  return PUT((uint8_t *)payload.c_str(), payload.length());
}

/**
 * sendRequest
 * @param type const char *     "GET", "POST", ....
 * @param payload String        data for the message body
 * @return
 */
int HTTPClient::sendRequest(const char *type, String payload) {
  return sendRequest(type, (uint8_t *)payload.c_str(), payload.length());
}

/**
 * sendRequest
 * @param type const char *     "GET", "POST", ....
 * @param payload uint8_t *     data for the message body if null not send
 * @param size size_t           size for the message body if 0 not send
 * @return -1 if no info or > 0 when Content-Length is set by server
 */
int HTTPClient::sendRequest(const char *type, uint8_t *payload, size_t size) {
  int code;
  bool redirect = false;
  uint16_t redirectCount = 0;
  do {
    // wipe out any existing headers from previous request
    for (size_t i = 0; i < _headerKeysCount; i++) {
      if (_currentHeaders[i].value.length() > 0) {
        _currentHeaders[i].value.clear();
      }
    }

    log_d("request type: '%s' redirCount: %d\n", type, redirectCount);

    // connect to server
    if (!connect()) {
      return returnError(HTTPC_ERROR_CONNECTION_REFUSED);
    }

    if (payload && size > 0) {
      addHeader(F("Content-Length"), String(size));
    }

    // add cookies to header, if present
    String cookie_string;
    if (generateCookieString(&cookie_string)) {
      addHeader("Cookie", cookie_string);
    }

