espressif/arduino-esp32/libraries/HTTPClient/src/HTTPClient.cpp
    // send Header
    if (!sendHeader(type)) {
      return returnError(HTTPC_ERROR_SEND_HEADER_FAILED);
    }

    // send Payload if needed
    if (payload && size > 0) {
      size_t sent_bytes = 0;
      while (sent_bytes < size) {
        size_t sent = _client->write(&payload[sent_bytes], size - sent_bytes);
        if (sent == 0) {
          log_w("Failed to send chunk! Lets wait a bit");
          delay(100);
          sent = _client->write(&payload[sent_bytes], size - sent_bytes);
          if (sent == 0) {
            log_e("Failed to send chunk!");
            break;
          }
        }
        sent_bytes += sent;
      }
      if (sent_bytes != size) {
        return returnError(HTTPC_ERROR_SEND_PAYLOAD_FAILED);
      }
    }

    code = handleHeaderResponse();
    log_d("sendRequest code=%d\n", code);

    // Handle redirections as stated in RFC document:
    // https://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html
    //
    // Implementing HTTP_CODE_FOUND as redirection with GET method,
    // to follow most of existing user agent implementations.
    //
    redirect = false;
    if (_followRedirects != HTTPC_DISABLE_FOLLOW_REDIRECTS && redirectCount < _redirectLimit && _location.length() > 0) {
      switch (code) {
        // redirecting using the same method
        case HTTP_CODE_MOVED_PERMANENTLY:
        case HTTP_CODE_TEMPORARY_REDIRECT:
        {
          if (
              // allow to force redirections on other methods
              // (the RFC require user to accept the redirection)
              _followRedirects == HTTPC_FORCE_FOLLOW_REDIRECTS ||
              // allow GET and HEAD methods without force
              !strcmp(type, "GET") || !strcmp(type, "HEAD")) {
            redirectCount += 1;
            log_d("following redirect (the same method): '%s' redirCount: %d\n", _location.c_str(), redirectCount);
            if (!setURL(_location)) {
              log_d("failed setting URL for redirection\n");
              // no redirection
              break;
            }
            // redirect using the same request method and payload, different URL
            redirect = true;
          }
          break;
        }
        // redirecting with method dropped to GET or HEAD
        // note: it does not need `HTTPC_FORCE_FOLLOW_REDIRECTS` for any method
        case HTTP_CODE_FOUND:
        case HTTP_CODE_SEE_OTHER:
        {
          redirectCount += 1;
          log_d("following redirect (dropped to GET/HEAD): '%s' redirCount: %d\n", _location.c_str(), redirectCount);
          if (!setURL(_location)) {
            log_d("failed setting URL for redirection\n");
            // no redirection
            break;
          }
          // redirect after changing method to GET/HEAD and dropping payload
          type = "GET";
          payload = nullptr;
          size = 0;
          redirect = true;
          break;
        }

        default: break;
      }
    }

  } while (redirect);
  // handle Server Response (Header)
  return returnError(code);
}

/**
 * sendRequest
 * @param type const char *     "GET", "POST", ....
 * @param stream Stream *       data stream for the message body
 * @param size size_t           size for the message body if 0 not Content-Length is send
 * @return -1 if no info or > 0 when Content-Length is set by server
 */
int HTTPClient::sendRequest(const char *type, Stream *stream, size_t size) {

  if (!stream) {
    return returnError(HTTPC_ERROR_NO_STREAM);
  }

  // connect to server
  if (!connect()) {
    return returnError(HTTPC_ERROR_CONNECTION_REFUSED);
  }

  if (size > 0) {
    addHeader("Content-Length", String(size));
  }

  // add cookies to header, if present
  String cookie_string;
  if (generateCookieString(&cookie_string)) {
    addHeader("Cookie", cookie_string);
  }

  // send Header
  if (!sendHeader(type)) {
    return returnError(HTTPC_ERROR_SEND_HEADER_FAILED);
  }

  int buff_size = HTTP_TCP_TX_BUFFER_SIZE;

  int len = size;
  int bytesWritten = 0;

  if (len == 0) {
    len = -1;
  }

  // if possible create smaller buffer then HTTP_TCP_TX_BUFFER_SIZE
  if ((len > 0) && (len < buff_size)) {
    buff_size = len;
  }

  // create buffer for read
  uint8_t *buff = (uint8_t *)malloc(buff_size);

  if (buff) {
    // read all data from stream and send it to server
    while (connected() && (stream->available() > -1) && (len > 0 || len == -1)) {

      // get available data size
      int sizeAvailable = stream->available();

      if (sizeAvailable) {

        int readBytes = sizeAvailable;

        // read only the asked bytes
        if (len > 0 && readBytes > len) {
          readBytes = len;
        }

        // not read more the buffer can handle
        if (readBytes > buff_size) {
          readBytes = buff_size;
        }

        // read data
        int bytesRead = stream->readBytes(buff, readBytes);

        // write it to Stream
        int bytesWrite = _client->write((const uint8_t *)buff, bytesRead);
        bytesWritten += bytesWrite;

        // are all Bytes a written to stream ?
        if (bytesWrite != bytesRead) {
          log_d("short write, asked for %d but got %d retry...", bytesRead, bytesWrite);

          // check for write error
          if (_client->getWriteError()) {
            log_d("stream write error %d", _client->getWriteError());

            //reset write error for retry
            _client->clearWriteError();
          }

          // some time for the stream
          delay(1);

          int leftBytes = (readBytes - bytesWrite);

          // retry to send the missed bytes
          bytesWrite = _client->write((const uint8_t *)(buff + bytesWrite), leftBytes);
          bytesWritten += bytesWrite;

          if (bytesWrite != leftBytes) {
            // failed again
            log_d("short write, asked for %d but got %d failed.", leftBytes, bytesWrite);
            free(buff);
            return returnError(HTTPC_ERROR_SEND_PAYLOAD_FAILED);
          }
        }

        // check for write error
        if (_client->getWriteError()) {
          log_d("stream write error %d", _client->getWriteError());
          free(buff);
          return returnError(HTTPC_ERROR_SEND_PAYLOAD_FAILED);
        }

