espressif/arduino-esp32/libraries/HTTPClient/src/HTTPClient.cpp
        // count bytes to read left
        if (len > 0) {
          len -= readBytes;
        }

        delay(0);
      } else {
        delay(1);
      }
    }

    free(buff);

    if (size && (int)size != bytesWritten) {
      log_d("Stream payload bytesWritten %d and size %d mismatch!.", bytesWritten, size);
      log_d("ERROR SEND PAYLOAD FAILED!");
      return returnError(HTTPC_ERROR_SEND_PAYLOAD_FAILED);
    } else {
      log_d("Stream payload written: %d", bytesWritten);
    }

  } else {
    log_d("too less ram! need %d", buff_size);
    return returnError(HTTPC_ERROR_TOO_LESS_RAM);
  }

  // handle Server Response (Header)
  return returnError(handleHeaderResponse());
}

/**
 * size of message body / payload
 * @return -1 if no info or > 0 when Content-Length is set by server
 */
int HTTPClient::getSize(void) {
  return _size;
}

/**
 * returns the stream of the tcp connection
 * @return NetworkClient
 */
NetworkClient &HTTPClient::getStream(void) {
  if (connected()) {
    return *_client;
  }

  log_w("getStream: not connected");
  static NetworkClient empty;
  return empty;
}

/**
 * returns a pointer to the stream of the tcp connection
 * @return NetworkClient*
 */
NetworkClient *HTTPClient::getStreamPtr(void) {
  if (connected()) {
    return _client;
  }

  log_w("getStreamPtr: not connected");
  return nullptr;
}

/**
 * write all  message body / payload to Stream
 * @param stream Stream *
 * @return bytes written ( negative values are error codes )
 */
int HTTPClient::writeToStream(Stream *stream) {

  if (!stream) {
    return returnError(HTTPC_ERROR_NO_STREAM);
  }

  if (!connected()) {
    return returnError(HTTPC_ERROR_NOT_CONNECTED);
  }

  // get length of document (is -1 when Server sends no Content-Length header)
  int len = _size;
  int ret = 0;

  if (_transferEncoding == HTTPC_TE_IDENTITY) {
    ret = writeToStreamDataBlock(stream, len);

    // have we an error?
    if (ret < 0) {
      return returnError(ret);
    }
  } else if (_transferEncoding == HTTPC_TE_CHUNKED) {
    int size = 0;
    while (1) {
      if (!connected()) {
        return returnError(HTTPC_ERROR_CONNECTION_LOST);
      }
      String chunkHeader = _client->readStringUntil('\n');

      if (chunkHeader.length() <= 0) {
        return returnError(HTTPC_ERROR_READ_TIMEOUT);
      }

      chunkHeader.trim();  // remove \r

      // read size of chunk
      len = (uint32_t)strtol((const char *)chunkHeader.c_str(), NULL, 16);
      size += len;
      log_v(" read chunk len: %d", len);

      // data left?
      if (len > 0) {
        int r = writeToStreamDataBlock(stream, len);
        if (r < 0) {
          // error in writeToStreamDataBlock
          return returnError(r);
        }
        ret += r;
      } else {

        // if no length Header use global chunk size
        if (_size <= 0) {
          _size = size;
        }

        // check if we have write all data out
        if (ret != _size) {
          return returnError(HTTPC_ERROR_STREAM_WRITE);
        }
        break;
      }

      // read trailing \r\n at the end of the chunk
      char buf[2];
      auto trailing_seq_len = _client->readBytes((uint8_t *)buf, 2);
      if (trailing_seq_len != 2 || buf[0] != '\r' || buf[1] != '\n') {
        return returnError(HTTPC_ERROR_READ_TIMEOUT);
      }

      delay(0);
    }
  } else {
    return returnError(HTTPC_ERROR_ENCODING);
  }

  //    end();
  disconnect(true);
  return ret;
}

/**
 * return all payload as String (may need lot of ram or trigger out of memory!)
 * @return String
 */
String HTTPClient::getString(void) {
  // _size can be -1 when Server sends no Content-Length header
  if (_size > 0 || _size == -1) {
    StreamString sstring;
    // try to reserve needed memory (noop if _size == -1)
    if (sstring.reserve((_size + 1))) {
      writeToStream(&sstring);
      return sstring;
    } else {
      log_d("not enough memory to reserve a string! need: %d", (_size + 1));
    }
  }

  return "";
}

/**
 * converts error code to String
 * @param error int
 * @return String
 */
String HTTPClient::errorToString(int error) {
  switch (error) {
    case HTTPC_ERROR_CONNECTION_REFUSED:  return F("connection refused");
    case HTTPC_ERROR_SEND_HEADER_FAILED:  return F("send header failed");
    case HTTPC_ERROR_SEND_PAYLOAD_FAILED: return F("send payload failed");
    case HTTPC_ERROR_NOT_CONNECTED:       return F("not connected");
    case HTTPC_ERROR_CONNECTION_LOST:     return F("connection lost");
    case HTTPC_ERROR_NO_STREAM:           return F("no stream");
    case HTTPC_ERROR_NO_HTTP_SERVER:      return F("no HTTP server");
    case HTTPC_ERROR_TOO_LESS_RAM:        return F("too less ram");
    case HTTPC_ERROR_ENCODING:            return F("Transfer-Encoding not supported");
    case HTTPC_ERROR_STREAM_WRITE:        return F("Stream write error");
    case HTTPC_ERROR_READ_TIMEOUT:        return F("read Timeout");
    default:                              return String();
  }
}

/**
 * adds Header to the request
 * @param name
 * @param value
 * @param first
 */
void HTTPClient::addHeader(const String &name, const String &value, bool first, bool replace) {
  // not allow set of Header handled by code
  if (!name.equalsIgnoreCase(F("Connection")) && !name.equalsIgnoreCase(F("User-Agent")) && !name.equalsIgnoreCase(F("Accept-Encoding"))
      && !name.equalsIgnoreCase(F("Host")) && !(name.equalsIgnoreCase(F("Authorization")) && _base64Authorization.length())) {

    String headerLine = name;
    headerLine += ": ";

    if (replace) {
      int headerStart = _headers.indexOf(headerLine);
      if (headerStart != -1 && (headerStart == 0 || _headers[headerStart - 1] == '\n')) {
        int headerEnd = _headers.indexOf('\n', headerStart);
        _headers = _headers.substring(0, headerStart) + _headers.substring(headerEnd + 1);
      }
    }

    headerLine += value;
    headerLine += "\r\n";
    if (first) {
      _headers = headerLine + _headers;
    } else {
      _headers += headerLine;
    }
  }
}

void HTTPClient::collectHeaders(const char *headerKeys[], const size_t headerKeysCount) {
  _headerKeysCount = headerKeysCount;
  if (_currentHeaders) {
    delete[] _currentHeaders;
  }
  _currentHeaders = new RequestArgument[_headerKeysCount];
  for (size_t i = 0; i < _headerKeysCount; i++) {
    _currentHeaders[i].key = headerKeys[i];
  }
}

