espressif/arduino-esp32/libraries/HTTPClient/src/HTTPClient.cpp
String HTTPClient::header(const char *name) {
  for (size_t i = 0; i < _headerKeysCount; ++i) {
    if (_currentHeaders[i].key.equalsIgnoreCase(name)) {
      return _currentHeaders[i].value;
    }
  }
  return String();
}

String HTTPClient::header(size_t i) {
  if (i < _headerKeysCount) {
    return _currentHeaders[i].value;
  }
  return String();
}

String HTTPClient::headerName(size_t i) {
  if (i < _headerKeysCount) {
    return _currentHeaders[i].key;
  }
  return String();
}

int HTTPClient::headers() {
  return _headerKeysCount;
}

bool HTTPClient::hasHeader(const char *name) {
  for (size_t i = 0; i < _headerKeysCount; ++i) {
    if ((_currentHeaders[i].key.equalsIgnoreCase(name)) && (_currentHeaders[i].value.length() > 0)) {
      return true;
    }
  }
  return false;
}

/**
 * init TCP connection and handle ssl verify if needed
 * @return true if connection is ok
 */
bool HTTPClient::connect(void) {
  if (connected()) {
    if (_reuse) {
      log_d("already connected, reusing connection");
    } else {
      log_d("already connected, try reuse!");
    }
    while (_client->available() > 0) {
      _client->read();
    }
    return true;
  }

#ifdef HTTPCLIENT_1_1_COMPATIBLE
  if (_transportTraits && !_client) {
    _tcpDeprecated = _transportTraits->create();
    if (!_tcpDeprecated) {
      log_e("failed to create client");
      return false;
    }
    _client = _tcpDeprecated.get();
  }
#endif

  if (!_client) {
    log_d("HTTPClient::begin was not called or returned error");
    return false;
  }
#ifdef HTTPCLIENT_1_1_COMPATIBLE
  if (_tcpDeprecated && !_transportTraits->verify(*_client, _host.c_str())) {
    log_d("transport level verify failed");
    _client->stop();
    return false;
  }
#endif
  if (!_client->connect(_host.c_str(), _port, _connectTimeout)) {
    log_d("failed connect to %s:%u", _host.c_str(), _port);
    return false;
  }

  // set Timeout for NetworkClient and for Stream::readBytesUntil() and Stream::readStringUntil()
  _client->setTimeout(_tcpTimeout);

  log_d(" connected to %s:%u", _host.c_str(), _port);

  /*
#ifdef ESP8266
    _client->setNoDelay(true);
#endif
 */
  return connected();
}

/**
 * sends HTTP request header
 * @param type (GET, POST, ...)
 * @return status
 */
bool HTTPClient::sendHeader(const char *type) {
  if (!connected()) {
    return false;
  }

  String header = String(type) + " " + _uri + F(" HTTP/1.");

  if (_useHTTP10) {
    header += "0";
  } else {
    header += "1";
  }

  header += String(F("\r\nHost: ")) + _host;
  if (_port != 80 && _port != 443) {
    header += ':';
    header += String(_port);
  }
  header += String(F("\r\nUser-Agent: ")) + _userAgent + F("\r\nConnection: ");

  if (_reuse) {
    header += F("keep-alive");
  } else {
    header += F("close");
  }
  header += "\r\n";

  if (!_useHTTP10) {
    header += String(F("Accept-Encoding: ")) + _acceptEncoding + F("\r\n");
  }

  if (_base64Authorization.length()) {
    _base64Authorization.replace("\n", "");
    header += F("Authorization: ");
    header += _authorizationType;
    header += " ";
    header += _base64Authorization;
    header += "\r\n";
  }

  header += _headers + "\r\n";

  return (_client->write((const uint8_t *)header.c_str(), header.length()) == header.length());
}

/**
 * reads the response from the server
 * @return int http code
 */
int HTTPClient::handleHeaderResponse() {

  if (!connected()) {
    return HTTPC_ERROR_NOT_CONNECTED;
  }

  _returnCode = 0;
  _size = -1;
  _canReuse = _reuse;

  String transferEncoding;

  _transferEncoding = HTTPC_TE_IDENTITY;
  unsigned long lastDataTime = millis();
  bool firstLine = true;
  String date;

  while (connected()) {
    size_t len = _client->available();
    if (len > 0) {
      String headerLine = _client->readStringUntil('\n');
      headerLine.trim();  // remove \r

      lastDataTime = millis();

      log_v("RX: '%s'", headerLine.c_str());

      if (firstLine) {
        firstLine = false;
        if (_canReuse && headerLine.startsWith("HTTP/1.")) {
          _canReuse = (headerLine[sizeof "HTTP/1." - 1] != '0');
        }
        int codePos = headerLine.indexOf(' ') + 1;
        _returnCode = headerLine.substring(codePos, headerLine.indexOf(' ', codePos)).toInt();
      } else if (headerLine.indexOf(':')) {
        String headerName = headerLine.substring(0, headerLine.indexOf(':'));
        String headerValue = headerLine.substring(headerLine.indexOf(':') + 1);
        headerValue.trim();

        if (headerName.equalsIgnoreCase("Date")) {
          date = headerValue;
        }

        if (headerName.equalsIgnoreCase("Content-Length")) {
          _size = headerValue.toInt();
        }

        if (_canReuse && headerName.equalsIgnoreCase("Connection")) {
          if (headerValue.indexOf("close") >= 0 && headerValue.indexOf("keep-alive") < 0) {
            _canReuse = false;
          }
        }

        if (headerName.equalsIgnoreCase("Transfer-Encoding")) {
          transferEncoding = headerValue;
        }

        if (headerName.equalsIgnoreCase("Location")) {
          _location = headerValue;
        }

        if (headerName.equalsIgnoreCase("Set-Cookie")) {
          setCookie(date, headerValue);
        }

        for (size_t i = 0; i < _headerKeysCount; i++) {
          if (_currentHeaders[i].key.equalsIgnoreCase(headerName)) {
            // Uncomment the following lines if you need to add support for multiple headers with the same key:
            // if (!_currentHeaders[i].value.isEmpty()) {
            //     // Existing value, append this one with a comma
            //     _currentHeaders[i].value += ',';
            //     _currentHeaders[i].value += headerValue;
            // } else {
            _currentHeaders[i].value = headerValue;
            // }
            break;  // We found a match, stop looking
          }
        }
      }

      if (headerLine == "") {
        log_d("code: %d", _returnCode);

        if (_size > 0) {
          log_d("size: %d", _size);
        }

        if (transferEncoding.length() > 0) {
          log_d("Transfer-Encoding: %s", transferEncoding.c_str());
          if (transferEncoding.equalsIgnoreCase("chunked")) {
            _transferEncoding = HTTPC_TE_CHUNKED;
          } else if (transferEncoding.equalsIgnoreCase("identity")) {
            _transferEncoding = HTTPC_TE_IDENTITY;
          } else {
            return HTTPC_ERROR_ENCODING;
          }
        } else {
          _transferEncoding = HTTPC_TE_IDENTITY;
        }

        if (_returnCode) {
          return _returnCode;
        } else {
          log_d("Remote host is not an HTTP Server!");
          return HTTPC_ERROR_NO_HTTP_SERVER;
        }
      }

    } else {
      if ((millis() - lastDataTime) > _tcpTimeout) {
        return HTTPC_ERROR_READ_TIMEOUT;
      }
      delay(10);
    }
  }

  return HTTPC_ERROR_CONNECTION_LOST;
}

/**
 * write one Data Block to Stream
 * @param stream Stream *
 * @param size int
 * @return < 0 = error >= 0 = size written
 */
int HTTPClient::writeToStreamDataBlock(Stream *stream, int size) {
  int buff_size = HTTP_TCP_RX_BUFFER_SIZE;
  int len = size;
  int bytesWritten = 0;

  // if possible create smaller buffer then HTTP_TCP_RX_BUFFER_SIZE
  if ((len > 0) && (len < buff_size)) {
    buff_size = len;
  }

