espressif/arduino-esp32/libraries/HTTPClient/src/HTTPClient.cpp
  // create buffer for read
  uint8_t *buff = (uint8_t *)malloc(buff_size);

  if (buff) {
    // read all data from server
    while (connected() && (len > 0 || len == -1)) {

      // get available data size
      size_t sizeAvailable = buff_size;
      if (len < 0) {
        sizeAvailable = _client->available();
      }

      if (sizeAvailable) {

        int readBytes = sizeAvailable;

        // read only the asked bytes
        if (len > 0 && readBytes > len) {
          readBytes = len;
        }

        // not read more the buffer can handle
        if (readBytes > buff_size) {
          readBytes = buff_size;
        }

        // stop if no more reading
        if (readBytes == 0) {
          break;
        }

        // read data
        int bytesRead = _client->readBytes(buff, readBytes);

        // write it to Stream
        int bytesWrite = stream->write(buff, bytesRead);
        bytesWritten += bytesWrite;

        // are all Bytes a written to stream ?
        if (bytesWrite != bytesRead) {
          log_d("short write asked for %d but got %d retry...", bytesRead, bytesWrite);

          // check for write error
          if (stream->getWriteError()) {
            log_d("stream write error %d", stream->getWriteError());

            //reset write error for retry
            stream->clearWriteError();
          }

          // some time for the stream
          delay(1);

          int leftBytes = (bytesRead - bytesWrite);

          // retry to send the missed bytes
          bytesWrite = stream->write((buff + bytesWrite), leftBytes);
          bytesWritten += bytesWrite;

          if (bytesWrite != leftBytes) {
            // failed again
            log_w("short write asked for %d but got %d failed.", leftBytes, bytesWrite);
            free(buff);
            return HTTPC_ERROR_STREAM_WRITE;
          }
        }

        // check for write error
        if (stream->getWriteError()) {
          log_w("stream write error %d", stream->getWriteError());
          free(buff);
          return HTTPC_ERROR_STREAM_WRITE;
        }

        // count bytes to read left
        if (len > 0) {
          len -= bytesRead;
        }

        delay(0);
      } else {
        delay(1);
      }
    }

    free(buff);

    log_v("connection closed or file end (written: %d).", bytesWritten);

    if ((size > 0) && (size != bytesWritten)) {
      log_d("bytesWritten %d and size %d mismatch!.", bytesWritten, size);
      return HTTPC_ERROR_STREAM_WRITE;
    }

  } else {
    log_w("too less ram! need %d", buff_size);
    return HTTPC_ERROR_TOO_LESS_RAM;
  }

  return bytesWritten;
}

/**
 * called to handle error return, may disconnect the connection if still exists
 * @param error
 * @return error
 */
int HTTPClient::returnError(int error) {
  if (error < 0) {
    log_w("error(%d): %s", error, errorToString(error).c_str());
    if (connected()) {
      log_d("tcp stop");
      _client->stop();
    }
  }
  return error;
}

void HTTPClient::setFollowRedirects(followRedirects_t follow) {
  _followRedirects = follow;
}

void HTTPClient::setRedirectLimit(uint16_t limit) {
  _redirectLimit = limit;
}

/**
 * set the URL to a new value. Handy for following redirects.
 * @param url
 */
bool HTTPClient::setURL(const String &url) {
  // if the new location is only a path then only update the URI
  if (url && url[0] == '/') {
    _uri = url;
    clear();
    return true;
  }

  if (!url.startsWith(_protocol + ':')) {
    log_d("new URL not the same protocol, expected '%s', URL: '%s'\n", _protocol.c_str(), url.c_str());
    return false;
  }

  // check if the port is specified
  int indexPort = url.indexOf(':', 6);  // find the first ':' excluding the one from the protocol
  int indexURI = url.indexOf('/', 7);   // find where the URI starts to make sure the ':' is not part of it
  if (indexPort == -1 || indexPort > indexURI) {
    // the port is not specified
    _port = (_protocol == "https" ? 443 : 80);
  }

  // disconnect but preserve _client.
  // Also have to keep the connection otherwise it will free some of the memory used by _client
  // and will blow up later when trying to do _client->available() or similar
  _canReuse = true;
  disconnect(true);
  return beginInternal(url, _protocol.c_str());
}

const String &HTTPClient::getLocation(void) {
  return _location;
}

void HTTPClient::setCookieJar(CookieJar *cookieJar) {
  _cookieJar = cookieJar;
}

void HTTPClient::resetCookieJar() {
  _cookieJar = nullptr;
}

void HTTPClient::clearAllCookies() {
  if (_cookieJar) {
    _cookieJar->clear();
  }
}

void HTTPClient::setCookie(String date, String headerValue) {
  if (!_cookieJar) {
    return;
  }
#define HTTP_TIME_PATTERN "%a, %d %b %Y %H:%M:%S"

  Cookie cookie;
  String value;
  int pos1, pos2;

  struct tm tm;
  strptime(date.c_str(), HTTP_TIME_PATTERN, &tm);
  cookie.date = mktime(&tm);

  pos1 = headerValue.indexOf('=');
  pos2 = headerValue.indexOf(';');

  if (pos1 >= 0 && pos2 > pos1) {
    cookie.name = headerValue.substring(0, pos1);
    cookie.value = headerValue.substring(pos1 + 1, pos2);
  } else {
    return;  // invalid cookie header
  }

  // only Cookie Attributes are case insensitive from this point on
  headerValue.toLowerCase();

  // expires
  if (headerValue.indexOf("expires=") >= 0) {
    pos1 = headerValue.indexOf("expires=") + strlen("expires=");
    pos2 = headerValue.indexOf(';', pos1);

    if (pos2 > pos1) {
      value = headerValue.substring(pos1, pos2);
    } else {
      value = headerValue.substring(pos1);
    }

    strptime(value.c_str(), HTTP_TIME_PATTERN, &tm);
    cookie.expires.date = mktime(&tm);
    cookie.expires.valid = true;
  }

  // max-age
  if (headerValue.indexOf("max-age=") >= 0) {
    pos1 = headerValue.indexOf("max-age=") + strlen("max-age=");
    pos2 = headerValue.indexOf(';', pos1);

    if (pos2 > pos1) {
      value = headerValue.substring(pos1, pos2);
    } else {
      value = headerValue.substring(pos1);
    }

    cookie.max_age.duration = value.toInt();
    cookie.max_age.valid = true;
  }

  // domain
  if (headerValue.indexOf("domain=") >= 0) {
    pos1 = headerValue.indexOf("domain=") + strlen("domain=");
    pos2 = headerValue.indexOf(';', pos1);

    if (pos2 > pos1) {
      value = headerValue.substring(pos1, pos2);
    } else {
      value = headerValue.substring(pos1);
    }

